<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"64d63e25eb75f5287d66ee3f39c154c5f1e3e7b660f2f67c66dbbe6388103932","plan_job_ref":"Job Terraform-plan #1 at https://github.com/ChrisHilsdon-6point6/terraform-aws-billing-alert/actions/runs/6769597261","plan_hash":"96f9afba5a74fd5f7dfb261780e145cd3eca7dd24e4d3ad76b7224ea754eaa97","plan_text_format":"text","version":"1.37.0"} -->
Terraform plan in __.__<details open><summary>With variables</summary>

```hcl
aws_access_key  = "*removed*"
aws_region      = "*removed*"
aws_secret_key  = ""
cw_alarm_period = 6
sns_alert_email = "*removed*"
```
</details>
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.zero_spend_budget_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "zero_spend_budget_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "A CloudWatch Alarm to keep within AWS free tier limits."
      + alarm_name                            = "zero_spend_budget"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "EstimatedCharges"
      + namespace                             = "AWS/Billing"
      + period                                = 21600
      + statistic                             = "Maximum"
      + tags_all                              = (known after apply)
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_sns_topic.zero_spend_budget_alert will be created
  + resource "aws_sns_topic" "zero_spend_budget_alert" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "zero_spend_budget_alert"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.zero_spend_budget_subscription will be created
  + resource "aws_sns_topic_subscription" "zero_spend_budget_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "admin@bikesuper.xyz"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform-plan #1](https://github.com/ChrisHilsdon-6point6/terraform-aws-billing-alert/actions/runs/6769597261)